import datetime
import os

###############################################################################
#  関数名： 時間切り捨て
#  処理概要： 引数で受けた年月日時の時間以降を0埋めにした値を返却する
#  引数1： datetime 年月日時
#  戻り値： datetime 時間以降を切り捨てた 年月日
###############################################################################
def modify_hhmmss_zero(target_time):
    return datetime.datetime.strptime(target_time.strftime("%Y/%m/%d"), "%Y/%m/%d")

###############################################################################
#  関数名： 日切り捨て
#  処理概要： 引数で受けた年月日時の日付以降を0埋めにした値を返却する
#  引数1： datetime 年月日時
#  戻り値： datetime 時間以降を切り捨てた 年月
###############################################################################
def modify_day_zero(target_time):
    return datetime.datetime.strptime(target_time.strftime("%Y/%m"), "%Y/%m")

###############################################################################
#  関数名： 月取得
#  処理概要： 引数で受けた年月日時のから年月を返却する
#  引数1： datetime 年月日時
#  戻り値： str 年月
###############################################################################
def get_month(target_time):
    return target_time.strftime("%Y/%m")

###############################################################################
#  関数名： 年取得
#  処理概要： 引数で受けた年月日時のから年を返却する
#  引数1： datetime 年月日時
#  戻り値： str 年
###############################################################################
def get_year(target_time):
    return target_time.strftime("%Y/%m")

###############################################################################
#  関数名： ファイル更新日付取得
#  処理概要： 引数で受けたファイルの更新日付取得を取得
#  引数1： str ファイルパス
#  戻り値： datetime 更新日付
###############################################################################
def get_file_updatetime(full_path):
    return datetime.datetime.fromtimestamp(os.stat(full_path).st_mtime)

###############################################################################
#  関数名： 設定ファイル読み込み
#  処理概要： 設定ファイルを読み取りモードで開き、オブジェクトを返却する
#  引数： なし
#  戻り値： jsonオブジェクト
###############################################################################
def read_settings():
    return open(os.path.join(os.path.dirname(__file__), "settings.json"), "r")
